<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		+ISPHwJDWhDrTIaWCg1bQTQ8PR8=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/analytics/coremldata.bin</key>
		<data>
		XHaRHDls4/S4FIvlR2Cvn3uHBm0=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/coremldata.bin</key>
		<data>
		1UVldcBbSd1tANS7IaJ/XXfq9hc=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/metadata.json</key>
		<data>
		dwcofqt7LGUMfbPcF8dZALal/kE=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		U6sFqbcOyo7P4KTbnpJ3xfxx+1M=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/coremldata.bin</key>
		<data>
		9cBeldGdqRMt98gkmvMHlt6LNOA=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.net</key>
		<data>
		Ia8mkn/o9sUCLwR2lVxKV+R1Gts=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.shape</key>
		<data>
		pGIykBtvmrKc2bzLjzKOVFiEpsw=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.weights</key>
		<data>
		ukaVRazSky6Y0ZeuPVWzuqYzepQ=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		AyvVi5cUgezTYZFS+H0JNPDYKgA=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/analytics/coremldata.bin</key>
		<data>
		gG00dOLWMlX5fQ7aE60Z8MwDxM4=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/coremldata.bin</key>
		<data>
		RAaK1S9ln6zTBCtQArBIgdnSrUo=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.net</key>
		<data>
		foCLQswYAk0IivkF5Hnt/SE33hI=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.shape</key>
		<data>
		zhT4XTUbzKK0FDe9rI8zPp94V1I=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.weights</key>
		<data>
		4OP3u8MT+KbnFqzn8uxrywhV26w=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model2/coremldata.bin</key>
		<data>
		xf6IP9CBrpe6d32aCO+yo7ntv9o=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/analytics/coremldata.bin</key>
		<data>
		MyCyins8KKOtTVbqWOGY8tj46mM=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/coremldata.bin</key>
		<data>
		X0ANF7C7MjklXc3eqUz11WXr1zM=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/metadata.json</key>
		<data>
		PWN8wrV3DysITjOkEfD/nXHWPYA=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.net</key>
		<data>
		nrn0YSORCyGwyD5HyiuMfjKyBTA=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.weights</key>
		<data>
		VZWMgJaUs47/22FQuVplK2SGHxY=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model/coremldata.bin</key>
		<data>
		AyvVi5cUgezTYZFS+H0JNPDYKgA=
		</data>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/LookKit-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			7ZzzTjGaX07oVWYWW0Odo/R0Ryf/16twNXp1QogXZjc=
			</data>
		</dict>
		<key>Headers/LookKit.h</key>
		<dict>
			<key>hash2</key>
			<data>
			AkEFPREUvgY/vyclOYgt9uU5316/P2yY80hUnEGXABw=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios-macabi.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			H6U6VoKTXHD5A5qN8SST2imkNfkMJhQN/KoInsgycc4=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios-macabi.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			l2iXiIxo1hMkMqdN2MIHSsETfonmNh5BQ1kTlxIm8Ck=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios-macabi.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			S59JUIPeFt1mO9z08lOg+v1/J9MOSotOkoXgD1gj3CY=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			H6U6VoKTXHD5A5qN8SST2imkNfkMJhQN/KoInsgycc4=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			l2iXiIxo1hMkMqdN2MIHSsETfonmNh5BQ1kTlxIm8Ck=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			S59JUIPeFt1mO9z08lOg+v1/J9MOSotOkoXgD1gj3CY=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64-apple-ios-macabi.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			CYA49qzAUzvgVd7jKW62BtErLe6q8ZVVQT/y7b2n5pk=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64-apple-ios-macabi.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			7wXo55T8L47d7hxda9JsffqoWQ8EwL8qBuSRWdVGjoM=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64-apple-ios-macabi.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			tzGl83T7/EC8V/SvQuRRj4MiIDFXj1bW6RnKTSNN9hk=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			CYA49qzAUzvgVd7jKW62BtErLe6q8ZVVQT/y7b2n5pk=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			7wXo55T8L47d7hxda9JsffqoWQ8EwL8qBuSRWdVGjoM=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			tzGl83T7/EC8V/SvQuRRj4MiIDFXj1bW6RnKTSNN9hk=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			JKuZdJ3bnn1dlmmKo3XMKn2BqfMfHYc7gGtgJx79PEM=
			</data>
		</dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			3zsIqNjdF8wJvRnyxC1mtSQOPuHO0rgO/1WY4Q2s8WA=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			6BqIkmc5o5CaQOH+KeJSDpNTDOP8+3w5IAiVhUbHrr8=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			VTszLoJodmY+jOj0KQfih677ad8ioVQ91FKkxfGFEU8=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			iASGftyPlJMuftSOHf745StZyF8l/D9paIa2asJnTQ4=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			qHmzcuM7myQx/XZ1SMWqPp7mZDle16+3zNUxZ2BA4K0=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			s9gyAC1/Y3U9otwXWxxdVO3sZF3EZLYbBH+iprtDBgE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			ainBaakj/vSvYtp1HlLjk/KmPgRi4V19lPih6Zj8U8Y=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			uZBwzySOTzaIuMmqsqnjLEkE58L1zfkez83dICpGt8M=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			UD1lBdwacPCVkM7Wws4WbQiu02gl7av2cW/pVY5mfM4=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			CJPCiEp21Qvpv+Xxrb6up2khi9N7a6oBM7aTqzbcKdg=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			wgp9m8U/wKv3BwirnAns8O5yW2WAb2PzUn8IS1a+6KE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			XLn5f6RVf7kECSBD9eDue3WMlvmm63e6JwW1U/pnp08=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Ah9CQZHrYQpAKaT9rzUWBelDVdWUT748pyHYUHo8QRE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			bvJMvqB0OShO9vADpxJT7dyqevsMNz8BJx4InEjXdPs=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			J6wybUB2kAP5Xmy0PvEqcw0Mi7yY+b+9izOeS3vtC9A=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model2/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			SqOJJk/FzzRSNOYZOlHHtr7P5BpXGEtzDb1GmOc/KYg=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			v2+MLodLZLiBN9ImblbhmCI2OVPoQN2nzewW7kuHY7I=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Rj8TyoDy2lW9dSjKM8+vZ4fRrNQOYt+BOZ4sHLgLbko=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			tWYIcjFX2eByWpjugTNuBGowhUaawJCit3Z0nvHVkt4=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			ktBX10msCsca1gJt79OKqhI5uo3Cf16znw96a753D6E=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			uvHobtBkhAism6PMOYHpWj4hflm2qRN/dBik6rJpseI=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			CJPCiEp21Qvpv+Xxrb6up2khi9N7a6oBM7aTqzbcKdg=
			</data>
		</dict>
		<key>Resources/facenet_keras_weights_coreml.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
