<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/LookKit-Swift.h</key>
		<data>
		NzyEDdflYU/dYWND84EHdWRo/Pw=
		</data>
		<key>Headers/LookKit.h</key>
		<data>
		WoKNhzaqWbDScso9zE5Zc/CbyAk=
		</data>
		<key>Info.plist</key>
		<data>
		Y9uz0v35Wj1gQPHYW1afBckyRkk=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<data>
		6hLAHUSyECkIcV0d/NcUXGgqUTw=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftinterface</key>
		<data>
		BWyYzmRBP7S5X4M9adeFauEgDX0=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<data>
		K/fc4ZHJtXYBV6HMWGXEbjFO1/A=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64.swiftdoc</key>
		<data>
		6hLAHUSyECkIcV0d/NcUXGgqUTw=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64.swiftinterface</key>
		<data>
		BWyYzmRBP7S5X4M9adeFauEgDX0=
		</data>
		<key>Modules/LookKit.swiftmodule/arm64.swiftmodule</key>
		<data>
		K/fc4ZHJtXYBV6HMWGXEbjFO1/A=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		6PJzSAtOjZVGCfNUS3l5P+B/4Xo=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/analytics/coremldata.bin</key>
		<data>
		MyCyins8KKOtTVbqWOGY8tj46mM=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/coremldata.bin</key>
		<data>
		X0ANF7C7MjklXc3eqUz11WXr1zM=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/metadata.json</key>
		<data>
		PWN8wrV3DysITjOkEfD/nXHWPYA=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.net</key>
		<data>
		nrn0YSORCyGwyD5HyiuMfjKyBTA=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.weights</key>
		<data>
		VZWMgJaUs47/22FQuVplK2SGHxY=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/model/coremldata.bin</key>
		<data>
		AyvVi5cUgezTYZFS+H0JNPDYKgA=
		</data>
		<key>facenet_keras_weights_coreml.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/LookKit-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			+fmkeI3naW/QSMAnij9jdSFcwghFI0Fn8hdnTc1j3QU=
			</data>
		</dict>
		<key>Headers/LookKit.h</key>
		<dict>
			<key>hash2</key>
			<data>
			AkEFPREUvgY/vyclOYgt9uU5316/P2yY80hUnEGXABw=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			lSxtrsIf8Y/EYtek5Bi5i8pbSmBK16JFSPVDJBPa7ac=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			1GLctxmk7X06Qc4ZvlwEXVdw0cCijoIk0W2w79xMLQI=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			uANAmNmRJPon6CJMfvHavJ6Fnf2VtRbRc493P5XyhLk=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			lSxtrsIf8Y/EYtek5Bi5i8pbSmBK16JFSPVDJBPa7ac=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			1GLctxmk7X06Qc4ZvlwEXVdw0cCijoIk0W2w79xMLQI=
			</data>
		</dict>
		<key>Modules/LookKit.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			uANAmNmRJPon6CJMfvHavJ6Fnf2VtRbRc493P5XyhLk=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			JKuZdJ3bnn1dlmmKo3XMKn2BqfMfHYc7gGtgJx79PEM=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			v2+MLodLZLiBN9ImblbhmCI2OVPoQN2nzewW7kuHY7I=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Rj8TyoDy2lW9dSjKM8+vZ4fRrNQOYt+BOZ4sHLgLbko=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			tWYIcjFX2eByWpjugTNuBGowhUaawJCit3Z0nvHVkt4=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			ktBX10msCsca1gJt79OKqhI5uo3Cf16znw96a753D6E=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			uvHobtBkhAism6PMOYHpWj4hflm2qRN/dBik6rJpseI=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			CJPCiEp21Qvpv+Xxrb6up2khi9N7a6oBM7aTqzbcKdg=
			</data>
		</dict>
		<key>facenet_keras_weights_coreml.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
